posts/2024-02-08-generate-rss-for-blog.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Generate RSS For Blog</title>
<meta name="generator" content="Org Mode">
<link rel="apple-touch-icon" sizes="180x180" href="/apple-touch-icon.png">
<link rel="icon" type="image/png" sizes="32x32" href="/favicon-32x32.png">
<link rel="icon" type="image/png" sizes="16x16" href="/favicon-16x16.png">
<link rel="manifest" href="/site.webmanifest">
<link rel="stylesheet" type="text/css" href="/css/main.bundle.min.css">
</head>
<body>
<header id="preamble" class="status">
<div class="site-header">
  <a class="site-title" href="/">Chuck</a>
  <div class="site-nav">
    <div id="menu-list" class="main-menu">
      <a href="/posts/">Posts</a>
      <a href="/about.html">About</a>
    </div>
    <button aria-label="Search" onclick="window.location.href='/search.html';">
      <svg width="20" height="20" viewBox="0 0 24 24">
        <path fill="currentcolor" d="M23.822 20.88l-6.353-6.354c.93-1.465 1.467-3.2 1.467-5.059.001-5.219-4.247-9.467-9.468-9.467s-9.468 4.248-9.468 9.468c0 5.221 4.247 9.469 9.468 9.469 1.768 0 3.421-.487 4.839-1.333l6.396 6.396 3.119-3.12zm-20.294-11.412c0-3.273 2.665-5.938 5.939-5.938 3.275 0 5.94 2.664 5.94 5.938 0 3.275-2.665 5.939-5.94 5.939-3.274 0-5.939-2.664-5.939-5.939z"></path>
      </svg>
    </button>
    <button id="appearance-switcher" aria-label="Appearance Switcher">
      <svg id="moon" width="20" height="20" viewBox="0 0 512 512">
        <path fill="currentcolor" d="M32 256C32 132.2 132.3 32 255.8 32c11.36.0 29.7 1.668 40.9 3.746 9.616 1.777 11.75 14.63 3.279 19.44C245 86.5 211.2 144.6 211.2 207.8c0 109.7 99.71 193 208.3 172.3 9.561-1.805 16.28 9.324 10.11 16.95C387.9 448.6 324.8 480 255.8 480 132.1 480 32 379.6 32 256z">
        </path>
      </svg>
      <svg id="sun" width="20" height="20" viewBox="0 0 512 512">
        <path fill="currentcolor" d="M256 159.1c-53.02.0-95.1 42.98-95.1 95.1s41.2 96.9 95.1 96.9 95.1-42.98 95.1-95.1S309 159.1 256 159.1zM509.3 347l-63.2-91.9 63.15-91.01c6.332-9.125 1.104-21.74-9.826-23.72l-109-19.7-19.7-109c-1.975-10.93-14.59-16.16-23.72-9.824L256 65.89 164.1 2.736c-9.125-6.332-21.74-1.107-23.72 9.824L121.6 121.6 12.56 141.3C1.633 143.2-3.596 155.9 2.736 164.1L65.89 256 2.74 347.01c-6.332 9.125-1.105 21.74 9.824 23.72l109 19.7 19.7 109c1.975 10.93 14.59 16.16 23.72 9.824L256 446.1l91.01 63.15c9.127 6.334 21.75 1.107 23.72-9.822l19.7-109 109-19.7C510.4 368.8 515.6 356.1 509.3 347zM256 383.1c-70.69.0-127.1-57.31-127.1-127.1.0-70.69 57.31-127.1 127.1-127.1S383.1 186.2 383.1 256c0 70.7-56.4 127.1-127.1 127.1z">
        </path>
      </svg>
    </button>
    <button id="menu-button" aria-label="Menu">
      <svg width="20" height="20" viewBox="0 0 448 512">
        <path fill="currentcolor" d="M0 96C0 78.33 14.33 64 32 64H416c17.7.0 32 14.33 32 32 0 17.7-14.3 32-32 32H32C14.33 128 0 113.7.0 96zM0 256c0-17.7 14.33-32 32-32H416c17.7.0 32 14.3 32 32s-14.3 32-32 32H32c-17.67.0-32-14.3-32-32zM416 448H32c-17.67.0-32-14.3-32-32s14.33-32 32-32H416c17.7.0 32 14.3 32 32s-14.3 32-32 32z">
        </path>
      </svg>
    </button>
  </div>
</div>
</header>
<main id="content" class="content">
<header>
<h1 class="title">Generate RSS For Blog</h1>
</header><nav id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#getting-posts-list">Getting Posts List</a></li>
<li><a href="#parsing-html">Parsing HTML</a></li>
<li><a href="#generating-rss-xml">Generating RSS XML</a></li>
</ul>
</div>
</nav>
<p>
I'm not sure how many people still use RSS, but I still want to have a RSS feed for my blog though I don't use RSS myself either.
</p>

<p>
From what I known, many people recommend using <a href="https://github.com/benedicthw/ox-rss">ox-rss.el</a> to generate RSS XML from blog files. The ox-rss.el is a org-export backed derived from the HTML backend and it exports org files to an RSS XML file. But ox-rss.el is not part of <a href="https://orgmode.org/worg/org-contrib/index.html">org-contrib</a> right now.
</p>

<p>
Luckily, Python has many modules which can generate and parse RSS feeds (<a href="https://github.com/lkiesow/python-feedgen">python-feedgen</a>, <a href="https://github.com/kurtmckee/feedparser">feedparser</a>, <a href="https://github.com/svpino/rfeed">rfeed</a>, etc.). I love Python, it is easy to use. So I decided to use python-feedgen to generate an RSS XML file from HTML files of my blog.
</p>
<section id="outline-container-getting-posts-list" class="outline-2">
<h2 id="getting-posts-list">Getting Posts List</h2>
<div class="outline-text-2" id="text-getting-posts-list">
<p>
I published all of blog files into a <code>public</code> directory, firstly I need to filter all necessary HTML files.
</p>

<div class="org-src-container">
<pre class="src src-python"><span class="org-keyword">import</span> os
<span class="org-keyword">import</span> fnmatch

<span class="org-variable-name">htmls</span> <span class="org-operator">=</span> [<span class="org-string">"public/index.html"</span>]
<span class="org-keyword">for</span> root, dirs, files <span class="org-keyword">in</span> os.walk(os.getcwd() <span class="org-operator">+</span> <span class="org-string">"/public/posts"</span>):
    <span class="org-variable-name">relpath</span> <span class="org-operator">=</span> os.path.relpath(root)
    <span class="org-keyword">for</span> filename <span class="org-keyword">in</span> fnmatch.<span class="org-builtin">filter</span>(files, <span class="org-string">"*.html"</span>):
        <span class="org-variable-name">filename</span> <span class="org-operator">=</span> os.path.join(relpath, filename)
        <span class="org-variable-name">filename</span> <span class="org-operator">=</span> filename.replace(<span class="org-string">"</span><span class="org-constant">\\</span><span class="org-string">"</span>, <span class="org-string">"/"</span>)
        htmls.append(filename)
htmls.sort(reverse<span class="org-operator">=</span><span class="org-constant">True</span>)
</pre>
</div>
</div>
</section>
<section id="outline-container-parsing-html" class="outline-2">
<h2 id="parsing-html">Parsing HTML</h2>
<div class="outline-text-2" id="text-parsing-html">
<p>
<a href="https://www.crummy.com/software/BeautifulSoup/">Beautiful Soup</a> is a powerful library that make it easy to scrape information from HTML files. I need to scrape <code>title</code> and page <code>content</code> from HTML files, and remove all blank lines in <code>content</code>.
</p>

<div class="org-src-container">
<pre class="src src-python"><span class="org-keyword">from</span> bs4 <span class="org-keyword">import</span> BeautifulSoup

<span class="org-variable-name">soup</span> <span class="org-operator">=</span> BeautifulSoup(htmlfile, <span class="org-string">"html.parser"</span>)
<span class="org-variable-name">title</span> <span class="org-operator">=</span> soup.title.string
<span class="org-variable-name">description</span> <span class="org-operator">=</span> soup.find(<span class="org-string">"div"</span>, class_<span class="org-operator">=</span><span class="org-string">"content"</span>).text
<span class="org-comment-delimiter"># </span><span class="org-comment">delete blank lines
</span><span class="org-variable-name">description</span> <span class="org-operator">=</span> <span class="org-string">"</span><span class="org-constant">\n</span><span class="org-string">"</span>.join([line <span class="org-keyword">for</span> line <span class="org-keyword">in</span> description.split(<span class="org-string">"</span><span class="org-constant">\n</span><span class="org-string">"</span>) <span class="org-keyword">if</span> line.strip()])
</pre>
</div>
</div>
</section>
<section id="outline-container-generating-rss-xml" class="outline-2">
<h2 id="generating-rss-xml">Generating RSS XML</h2>
<div class="outline-text-2" id="text-generating-rss-xml">
<p>
It is easy to <a href="https://github.com/lkiesow/python-feedgen#create-a-feed">create a feed</a> and <a href="https://github.com/lkiesow/python-feedgen#generate-the-feed">generate a feed</a> by following the <a href="https://lkiesow.github.io/python-feedgen/">documentation</a>. The most important elements are <code>title</code>, <code>link</code> and <code>description</code>. 
</p>

<p>
This blog is published by org, here is a trick to generate rss automatically.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">with-eval-after-load</span> 'ox-publish
  (<span class="org-keyword">defun</span> <span class="org-function-name">dotemacs-generate-rss</span> (project <span class="org-type">&amp;optional</span> force async)
    (<span class="org-keyword">let</span> ((default-directory dotemacs-org-site-dir))
      (dotemacs-call-process <span class="org-string">"python"</span> <span class="org-string">"rss.py"</span>))
    (message <span class="org-string">"dotemacs generate rss in %s"</span> dotemacs-org-site-dir))
  (advice-add 'org-publish-project <span class="org-builtin">:after</span> #'dotemacs-generate-rss))
</pre>
</div>
</div>
</section>
</main>
<footer id="postamble" class="status">
<div class="site-footer">
  <p>&copy 2026 Chuck</p>
  <p>Powered by <a href="https://www.gnu.org/software/emacs/">Emacs</a></p>
</div>
<a href="#top" class="top-link" id="top-link" style="visibility: hidden; opacity: 0;">
  <svg xmlns="http://www.w3.org/2000/svg" height="24px" width="24px" viewBox="0 -960 960 960" fill="currentcolor">
    <path d="M440-160v-487L216-423l-56-57 320-320 320 320-56 57-224-224v487h-80Z"></path>
  </svg>
</a>
</footer>
</body>
</html>
